HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/rivuletPanel/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    location    "0";
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    sides
    {
        type            fixedValue;
        value           uniform 300;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            fixedValue;
        value           uniform 300;
    }
}

// ************************************************************************* //
