HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/rivuletPanel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0.1;
    }

    "(rho|G)Final"
    {
        $rho;
        tolerance       1e-05;
        relTol          0;
    }

    "(U|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       0;
        relTol          0.1;
    }

    "(U|h)Final"
    {
        $U;
        relTol          0;
        tolerance       1e-05;
    }

    "(k|epsilon)"
    {
        $UFinal;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-06;
        relTol          0;
    }

    "(Yi|O2|N2|H2O)"
    {
        $hFinal;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
    solvePrimaryRegion no;
}

relaxationFactors
{
    fields
    {
        ".*Final"       1;
    }
    equations
    {
        ".*Final"       1;
    }
}


// ************************************************************************* //
